[
  {
    "projects": [
      {
        "id": 0,
        "image": "alc-consultora",
        "url": "https://consultora-alc.online",
        "repo": "Private — Client Work",
        "stack": ["PHP", "CSS", "JavaScript"],
        "translations": {
          "es": {
            "title": "Consultora ALC",
            "description": "Sitio web corporativo desarrollado para un cliente freelance. El proyecto se centró en presentar los servicios de la empresa, fortalecer su presencia digital y ofrecer canales de contacto claros para potenciales clientes.",
            "purpose": "Diseñar y desarrollar un sitio web moderno y responsive que comunique la identidad de marca y los servicios de la consultora.",
            "development_process": "El desarrollo comenzó con la planificación de la estructura y la organización del contenido según los requerimientos del cliente. La interfaz fue diseñada con una estética limpia y profesional, priorizando la claridad visual y la adaptabilidad a distintos dispositivos. Se realizaron ajustes iterativos en base al feedback recibido."
          },
          "en": {
            "title": "Consultora ALC",
            "description": "Corporate website developed for a freelance client. The project focused on presenting the company's services, strengthening its digital presence, and providing clear contact channels for potential customers.",
            "purpose": "To design and develop a modern, responsive corporate website that communicates the brand identity and services of the consulting firm.",
            "development_process": "The development began with layout planning and content structuring based on client requirements. The UI was designed with a clean and professional aesthetic, prioritizing readability and responsiveness. Iterations were made based on client feedback to refine visual hierarchy and usability."
          }
        }
      },
      {
        "id": 1,
        "image": "todo-app",
        "url": "https://todo-app.gonzalojaime.codes/",
        "repo": "https://github.com/GzaJai/todo-app-django",
        "stack": ["Django", "Python", "SQLite", "HTML", "CSS"],
        "translations": {
          "es": {
            "title": "Aplicación de Tareas",
            "description": "Aplicación web de gestión de tareas que permite crear, editar, completar y eliminar tareas diarias. La interfaz fue diseñada con un enfoque minimalista para priorizar la facilidad de uso.",
            "purpose": "Construir un sistema CRUD completo para practicar fundamentos de desarrollo backend y arquitectura MVC utilizando Django.",
            "development_process": "El proyecto se desarrolló como ejercicio de aprendizaje para reforzar conceptos clave de Django: modelos, vistas, templates y routing. Se diseñó una base de datos simple para la persistencia de tareas. Se implementaron validaciones, formularios y operaciones CRUD. Posteriormente se realizaron mejoras en la estructura del código y experiencia de usuario."
          },
          "en": {
            "title": "Task Manager App",
            "description": "Task management web application designed to allow users to create, organize, update, and delete daily tasks. The system provides a minimalistic interface emphasizing usability and efficiency.",
            "purpose": "To build a CRUD-based task management system while practicing backend development concepts and MVC architecture.",
            "development_process": "The project was developed as a learning exercise to strengthen Django fundamentals, including models, views, templates, and routing. The database schema was designed to support task persistence. Emphasis was placed on implementing CRUD operations, form validation, and basic UI structure. The application evolved through incremental improvements in UX and code organization."
          }
        }
      },
      {
        "id": 2,
        "image": "po-compressed",
        "url": "https://presupuestos.gonzalojaime.codes/",
        "repo": "https://github.com/GzaJai/presupuestos-online",
        "stack": [
            "React",
            "TailwindCSS",
            "JavaScript",
            "HTML",
            "CSS"
        ],
        "translations": {
            "es": {
            "title": "Presupuestos Online",
            "description": "Aplicación web desarrollada para la generación de presupuestos de forma rápida e interactiva. Permite al usuario ingresar conceptos, cantidades y precios, calculando automáticamente subtotales y totales, con opción de exportación a PDF.",
            "purpose": "Digitalizar y optimizar el proceso de creación de presupuestos comerciales, mejorando la precisión de los cálculos y reduciendo el trabajo manual.",
            "development_process": "El proyecto fue desarrollado con React, estructurando la interfaz en componentes reutilizables y gestionando el estado para actualizar cálculos en tiempo real. Se implementó lógica de validación de datos y generación dinámica del documento PDF. El diseño priorizó claridad visual, rapidez de uso y una experiencia fluida. Se realizaron ajustes iterativos para mejorar la usabilidad y la presentación del presupuesto exportado."
            },
            "en": {
            "title": "Online Budget Generator",
            "description": "Web application built for generating budgets quickly and interactively. Users can enter items, quantities, and prices, with automatic calculations and PDF export functionality.",
            "purpose": "To digitize and optimize the budget creation workflow, improving calculation accuracy and reducing manual effort.",
            "development_process": "The project was developed using React, structuring the UI with reusable components and managing state for real-time updates. Data validation logic and dynamic PDF generation were implemented. The design focused on clarity, speed, and a smooth user experience. Iterative refinements were made to enhance usability and the visual presentation of the exported document."
            }
        }
      },
      {
        "id": 3,
        "image": "ch-compressed",
        "url": "https://country-hunt.gonzalojaime.codes/",
        "repo": "https://github.com/GzaJai/country-hunt",
        "stack": ["JavaScript", "HTML", "CSS"],
        "translations": {
          "es": {
            "title": "Country Hunt",
            "description": "Juego interactivo en el navegador donde el usuario debe relacionar banderas de países con sus nombres correctos.",
            "purpose": "Desarrollar un mini-juego educativo para practicar manipulación del DOM, eventos y manejo de estado.",
            "development_process": "Se diseñó la lógica del juego basada en selección y validación de respuestas. Se implementó aleatorización, control de estado y feedback visual. Se realizaron pruebas iterativas para ajustar dificultad y mejorar la jugabilidad."
          },
          "en": {
            "title": "Country Hunt",
            "description": "Interactive browser-based game where players match country flags with their corresponding names.",
            "purpose": "To develop an educational mini-game while practicing DOM manipulation and state management.",
            "development_process": "The game logic was designed around randomization and matching mechanics, including user interaction handling and visual feedback."
          }
        }
      }
    ]
  }
]
